<?php

return [
    'sex' => [
        '0'     =>	'未知',
        '1'     =>	'男',
        '2'		=>	'女',
    ],

    'identity' => [
        '0' => '普通',
        '1' => '竞品主播',
        '2' => '高颜值主播',
        '3' => '普通主播',
        '4' => '竞品公会主播',
        '5' => '高颜值公会主播',
        '6' => '普通公会主播',
    ],

    'loginsource' => [
        '1' => '酷我账号',
        '2' => '微博',
        '3' => 'QQ',
        '4' => '微信',
        '5' => '短信登录',
        '10' => 'PC',
    ],

    'status' => [
        '0' => '正常',
        '1' => '认证',
        '2' => '限制',
    ],

    'livestatus' => [
        '0' => '正常',
        '1' => '优先',
        '2' => '限制',
        '3' => '删除',
    ],

    'livepstatus' => [
        '-3' => '非正常关闭',
        '-2' => '不保存',
        '-1' => '停止',
        '0' => '直播',
        '1' => '回播'
    ],

    'consumestatus' => [
        '0' => '处理中',
        '1' => '成功',
        '99' => '用户确认取消'
    ],

    'devtype' => [
        '0' => '未知',
        '1' => 'Ios',
        '2' => 'ar'
    ],

    'consumeptype' => [
        '0' => '本地交易',
        '1' => '支付宝',
        '2' => '微信'
    ],

    'noticestatus' => [
        '0' => '正常',
        '1' => '删除',
    ],

    'photowallstatus' => [
        '0' => '未审核',
        '1' => '已审核',
        '2' => '已删除',
        '3' => '未通过',
    ],
    'reporttypes'   => [
        '0' =>   '无',
        '1' =>  '涉黄',
        '2' =>  '政治敏感',
        '3' =>  '其他',
    ],
];
