<?php
namespace App\Models\Integration;

class Banknu
{/*{{{*/

    public static $_BankOfProince = array(
        'bank' => array(
           102 => '中国工商银行',
           103 => '中国农业银行',
           104 => '中国银行',
           105 => '中国建设银行',
           301 => '交通银行',
           302 => '中信银行',
           303 => '中国光大银行',
           305 => '中国民生银行',
           306 => '广发银行',
           307 => '平安银行',
           308 => '招商银行',
           309 => '兴业银行',
           310 => '浦发银行',
           313 => '城市商业银行',
           403 => '中国邮政储蓄银行',
        ),

        'proince' => array(
            1 => '北京市',
            2 => '上海市',
            3 => '天津市',
            4 => '重庆市',
            5 => '河北省',
            6 => '山西省',
            7 => '内蒙古自治区',
            8 => '辽宁省',
            9 => '吉林省',
            10 => '黑龙江',
            11 => '江苏省',
            12 => '浙江省',
            13 => '安徽省',
            14 => '福建省',
            15 => '江西省',
            16 => '山东省',
            17 => '河南省',
            18 => '湖北省',
            19 => '湖南省',
            20 => '广东省',
            21 => '广西壮族自治区',
            22 => '海南省',
            23 => '四川省',
            24 => '贵州省',
            25 => '云南省',
            26 => '西藏自治区',
            27 => '陕西省',
            28 => '甘肃省',
            29 => '青海省',
            30 => '宁夏回族自治区',
            31 => '新疆维吾尔自治区',
         ),

        'city' => array(
            1 => array(1000 =>'北京市'),
            2 => array(2900 =>'上海市'),
            3 => array(1100 =>'天津市'),
            4 => array(6530 =>'重庆市'),
            5 => array(
                1210 => '石家庄市', 1240 => '唐山市', 1260 => '秦皇岛市',
                1270 => '邯郸市', 1310 => '邢台市', 1340 => '保定市',
                1380 => '张家口市', 1410 => '承德市', 1430 => '沧州市',
                1460 => '廊坊市', 1480 => '衡水市',
            ),
            6 => array(
                  1610 => '太原市', 1620 => '大同市', 1630 => '阳泉市',
                  1640 => '长冶市', 1680 => '晋城市', 1690 => '朔州市',
                  1710 => '忻州市', 1750 => '晋中市', 1770 => '临汾市',
                  1810 => '运城市', 1730 => '吕梁市',
            ),
            7 => array(
                  1910 => '呼和浩特市', 1920 => '包头市', 1930 => '乌海市',
                  1940 => '赤峰市', 1960 => '呼伦贝尔市', 1980 => '兴安盟',
                  1990 => '通辽市', 2010 => '锡林郭勒盟', 2030 => '乌兰察布市',
                  2050 => '鄂尔多斯市', 2070 => '巴彦淖尔市', 2080 => '阿拉善盟',
            ),
            8 => array(
                  2210 => '沈阳市', 2220 => '大连市', 2230 => '鞍山市',
                  2240 => '抚顺市', 2250 => '本溪市', 2260 => '丹东市',
                  2270 => '锦州市', 2280 => '营口市', 2290 => '阜新市',
                  2310 => '辽阳市', 2330 => '铁岭市', 2340 => '朝阳市',
                  2320 => '盘锦市', 2276 => '葫芦岛市',
            ),
            9 => array(
                  2410 => '长春市', 2420 => '吉林市', 2430 => '四平市',
                  2440 => '辽源市', 2450 => '通化市', 2460 => '白山市',
                  2470 => '白城市', 2490 => '延边州', 2520 => '松原市',
            ),
            10 => array(
                2690 => '佳木斯市', 2710 => '伊春市', 2720 => '牡丹江市',
                2740 => '七台河市', 2760 => '绥化市', 2780 => '黑河市',
                2790 => '大兴安岭地区', 2640 => '齐齐哈尔市', 2680 => '双鸭山市',
                2650 => '大庆市', 2670 => '鹤岗市', 2610 => '哈尔滨市',
                2660 => '鸡西市',
            ),
            11 => array(
                3010 => '南京市', 3020 => '无锡市', 3030 => '徐州市',
                3040 => '常州市', 3050 => '苏州市', 3060 => '南通市',
                3070 => '连云港市', 3080 => '淮安市', 3090 => '宿迁市',
                3110 => '盐城市', 3120 => '扬州市', 3128 => '泰州市',
                3140 => '镇江市',
            ),
            12 => array(
                3310 => '杭州市', 3320 => '宁波市', 3330 => '温州市',
                3350 => '嘉兴市', 3360 => '湖州市', 3370 => '绍兴市',
                3380 => '金华市', 3410 => '衢州市', 3420 => '舟山市',
                3430 => '丽水市', 3450 => '台州市',
            ),
            13 => array(
                3610 => '合肥市', 3630 => '蚌埠市', 3640 => '淮南市',
                3660 => '淮北市', 3620 => '芜湖市', 3650 => '马鞍山市',
                3670 => '铜陵市', 3710 => '黄山市', 3722 => '亳州市',
                3720 => '阜阳市', 3680 => '安庆市', 3781 => '巢湖市',
                3790 => '池州市', 3740 => '宿州市', 3760 => '六安市',
                3750 => '滁州市', 3771 => '宣城市',
            ),
            14 => array(
                3910 => '福州市', 3930 => '厦门市', 3940 => '莆田市',
                3950 => '三明市', 3970 => '泉州市', 3990 => '漳州市',
                4010 => '南平市', 4030 => '宁德市', 4050 => '龙岩市',
            ),
            15 => array(
                4210 => '南昌市', 4220 => '景德镇市', 4230 => '萍乡市',
                4240 => '九江市', 4260 => '新余市', 4280 => '赣州市',
                4310 => '宜春市', 4330 => '上饶市', 4350 => '吉安市',
                4370 => '抚州市', 4270 => '鹰潭市',
            ),
            16 => array(
                4510 => '济南市', 4520 => '青岛市', 4530 => '淄博市',
                4540 => '枣庄市', 4550 => '东营市', 4560 => '烟台市',
                4580 => '潍坊市', 4732 => '日照市', 4610 => '济宁市',
                4630 => '泰安市', 4634 => '莱芜市', 4650 => '威海市',
                4660 => '滨州市', 4680 => '德州市', 4710 => '聊城市',
                4730 => '临沂市', 4750 => '菏泽市',
            ),
            17 => array(
                4910 => '郑州市', 4920 => '开封市', 4930 => '洛阳市',
                4950 => '平顶山市', 4960 => '安阳市', 4970 => '鹤壁市',
                4980 => '新乡市', 5010 => '焦作市', 5020 => '濮阳市',
                5030 => '许昌市', 5040 => '漯河市', 5050 => '三门峡市',
                5060 => '商丘市', 5080 => '周口市', 5110 => '驻马店市',
                5130 => '南阳市', 5150 => '信阳市',
            ),
            18 => array(
                5210 => '武汉市', 5220 => '黄石市', 5230 => '十堰市',
                5260 => '宜昌市', 5280 => '襄樊市', 5286 => '随州市',
                5310 => '鄂州市', 5320 => '荆门市', 5330 => '黄冈市',
                5350 => '孝感市', 5360 => '咸宁市', 5370 => '荆州市',
                5374 => '天门市', 5410 => '恩施州',
            ),
            19 => array(
                5510 => '长沙市', 5520 => '株洲市', 5530 => '湘潭市',
                5540 => '衡阳市', 5550 => '邵阳市', 5570 => '岳阳市',
                5580 => '常德市', 5590 => '张家界市', 5610 => '益阳市',
                5620 => '娄底市', 5630 => '郴州市', 5650 => '永州市',
                5670 => '怀化市', 5690 => '吉首市',
            ),
            20 =>  array(
                5810 => '广州市', 5820 => '韶关市', 5840 => '深圳市',
                5850 => '珠海市', 5860 => '汕头市', 5865 => '揭阳市',
                5869 => '潮州市', 5880 => '佛山市', 5890 => '江门市',
                5910 => '湛江市', 5920 => '茂名市', 5930 => '肇庆市',
                5937 => '云浮市', 5950 => '惠州市', 5960 => '梅州市',
                5970 => '汕尾市', 5980 => '河源市', 5990 => '阳江市',
                6010 => '清远市', 6020 => '东莞市', 6030 => '中山市',
            ),
            21 => array(
                6110 => '南宁市', 6140 => '柳州市', 6155 => '来宾市',
                6170 => '桂林市', 6210 => '梧州市', 6225 => '贺州市',
                6230 => '北海市', 6240 => '玉林市', 6242 => '贵港市',
                6261 => '百色市', 6281 => '河池市', 6311 => '钦州市',
                6330 => '防城港市',
            ),
            22 => array(
                6410 => '海口市', 6420 => '三亚市',
            ),
            23 => array(
                6510 => '成都市', 6550 => '自贡市', 6560 => '攀枝花市',
                6570 => '泸州市', 6580 => '德阳市', 6590 => '绵阳市',
                6610 => '广元市', 6620 => '遂宁市', 6630 => '内江市',
                6636 => '资阳市', 6650 => '乐山市', 6652 => '眉山市',
                6710 => '宜宾市', 6730 => '南充市', 6737 => '广安市',
                6750 => '达州市', 6758 => '巴中市', 6770 => '雅安市',
                6840 => '凉山州', 6818 => '阿坝州', //6818 => '甘孜州',
            ),
            24 => array(
                7010 => '贵阳市', 7020 => '六盘水市', 7030 => '遵义市',
                7050 => '铜仁地区', 7070 => '黔西南州', 7090 => '毕节地区',
                7110 => '安顺市', 7130 => '黔东南州', 7150 => '黔南州',
            ),
            25 => array(
                7310 => '昆明市', 7340 => '昭通市', 7360 => '曲靖市',
                7410 => '玉溪市', 7490 => '西双版纳州', 7530 => '保山市',
                7546 => '德宏州', 7450 => '文山州', 7441 => '红河州',
                7560 => '怒江州', 7570 => '迪庆州', 7580 => '临沧市',
                7550 => '丽江市', 7380 => '楚雄州', 7510 => '大理州',
                7470 => '思茅市',
            ),
            26 => array(
                7760 => '日喀则地区', 7700 => '拉萨市', 7711 => '樟木口岸镇',
                7721 => '昌都地区', 7830 => '林芝地区', 7740 => '山南地区',
                7790 => '那曲地区', 7813 => '阿里地区',
            ),
            27 => array(
                7910 => '西安市', 7920 => '铜川市', 7930 => '宝鸡市',
                7950 => '咸阳市', 7970 => '渭南市', 7990 => '汉中市',
                8010 => '安康市', 8030 => '商洛市', 8040 => '延安市',
                8060 => '榆林市',
            ),
            28 => array(
                8210 => '兰州市', 8220 => '嘉峪关市', 8230 => '金昌市',
                8240 => '白银市', 8250 => '天水市', 8260 => '酒泉市',
                8270 => '张掖市', 8280 => '武威市', 8290 => '定西市',
                8310 => '陇南市', 8330 => '平凉市', 8340 => '庆阳市',
                8360 => '临夏州', 8380 => '甘南州',
            ),
            29 => array(
                8510 => '西宁市', 8540 => '海北藏族自治州', 8550 => '黄南藏族自治州',
                8560 => '海南藏族自治州', 8570 => '果洛藏族自治州',
                8580 => '玉树藏族自治州', 8590 => '海西蒙古族藏族自治州',
                8591 => '海西蒙古族藏族自治州', 8592 => '海西蒙古族藏族自治州',
            ),
            30 => array(
                8710 => '银川市', 8720 => '石嘴山市', 8731 => '吴忠市',
                8741 => '固原市',
            ),
            31 => array(
                8810 => '乌鲁木齐市', 8820 => '克拉玛依市', 8830 => '吐鲁番地区',
                8840 => '哈密地区', 8850 => '昌吉回族自治州', 8910 => '阿克苏地区',
                8940 => '喀什地区', 8960 => '和田地区', 8980 => '伊犁哈萨克自治州',
                9010 => '塔城地区', 9020 => '阿勒泰地区', 9028 => '石河子市',
                9032 => '巴音郭楞蒙古自治州', 9033 => '博尔塔拉蒙古自治州',
                9034 => '克孜勒苏柯尔克孜自治州',
            ),
        ),
    );



    public static function getBank()
    {/*{{{*/
        return self::$_BankOfProince;
    }/*}}}*/



}/*}}}*/
?>
